Revit 2027 API
ConceptualConstructionFloorSlabType Enumeration
 ConceptualConstructionType values for Floors.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum ConceptualConstructionFloorSlabType
Public Enumeration ConceptualConstructionFloorSlabType
public enum class ConceptualConstructionFloorSlabType
type ConceptualConstructionFloorSlabType
Members
Member name | Value | Description
HighMassConstructionColdClimateSlabInsulation | 5 |  High Mass Construction Cold Climate Insulation Slab
HighMassConstructionFrigidClimateSlabInsulation | 4 |  High Mass Construction Frigid Climate Insulation Slab
HighMassConstructionTypicalNoInsulation | 6 |  High Mass Construction Typical No Insulation Slab
InvalidFloorSlabTypeConstruction | -1 |  Invalid/not set Floor or Slab Type construction value
LightweightConstructionHighInsulation | 0 |  Lightweight Construction High Insulation Floor
LightweightConstructionLowInsulation | 2 |  Lightweight Construction Low Insulation Floor
LightweightConstructionNoInsulationInterior | 3 |  Lightweight Construction No Insulation Interior Floor
LightweightConstructionTypicalInsulation | 1 |  Lightweight Construction Typical Insulation Floor
NumFloorSlabTypeConstruction | 7 |  Total number of Floor/Slab Constructions
See Also
Reference
Autodesk.Revit.DB.Analysis Namespace